app/controllers/tasks_controller.rb

  def show

    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @task = Task.new(action: params[:task][:action],
      description: params[:task][:description],
      completion_date: params[:task][:completion_date])

      if @task.save
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["action", "e"], ["description", "r"], ["created_at", "2018-09-21 01:27:46.916178"], ["updated_at", "2018-09-21 01:27:46.916178"], ["completion_date", "t"]]

    task = Task.find_by(id: params[:id])
    if task.update(action: params[:task][:action],
      description: params[:task][:description],
      completion_date: params[:task][:completion_date])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "a lot"], ["completion_date", ""], ["updated_at", "2018-09-21 18:18:41.468056"], ["id", 2]]

    task = Task.find_by(id: params[:id])

    if task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]

    task = Task.find_by(id: params[:id])

    if task.completion_date == nil
      task.completion_date = Date.today
      task.save
      redirect_to tasks_path
    else
      task.completion_date = nil
      task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-22 01:14:15.932232"], ["id", 20]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-22 01:14:27.048815"], ["id", 21]]